# Chapter10. Pandas(1)

In [1]:
import pandas as pd
import numpy as np

In [2]:
arr = pd.Series([1,3,5,7])
print(type(arr)) # Series 객체
print(arr) # 인덱스 번호까지 함꼐 출력된다..
print(arr.values)
print(arr.index)
print(arr.dtype)

<class 'pandas.core.series.Series'>
0    1
1    3
2    5
3    7
dtype: int64
[1 3 5 7]
RangeIndex(start=0, stop=4, step=1)
int64

In [3]:
data=np.random.randint(20,size=5)
arr=pd.Series(data,index=['a','b','c','d','e']) #인덱스를 사용자가 지정으로 바뀐다
print(arr)

print(arr[0])  # 원래있던 idx를 이용하여 value get
print(arr['a']) #사용자지정 idx를사용하여 value를 get

a    16
b    13
c     5
d     0
e     3
dtype: int32
16
16

In [4]:
data={"name":"kello","age":23,"grade":'A+'}

arr=pd.Series(data) #dict 로 만들시 key -> index value -> value
arr.name="testing" # Series의 이름이 붙는다
arr.index.name="NO" #인덱스의 이름은 NO

print(arr)

NO
name     kello
age         23
grade       A+
Name: testing, dtype: object

In [5]:
D1 = pd.Series([10,20,30],index=['NAVER','GOOGLE','DAUM'])
D2 = pd.Series([10,20,30],index=['GOOGLE','DAUM','NAVER'])

MERGE = D1 + D2 #Series끼리의 연산은 같은 idx끼리 연산을 진행한다

print(MERGE)

DAUM      50
GOOGLE    30
NAVER     40
dtype: int64

In [6]:
obj = pd.Series({"love":3,"me":2})

print(obj) # love key value 3 me key value 2

love    3
me      2
dtype: int64

## Series 연습문제

* 리스트만으로 생성  
* 딕셔너리만으로 생성  
* 리스트와 index 를 이용하여 생성  
* 각 Series 에 대해 indexing 을 통해 원하는 값을 선택하시오  
* 각 Series 에 2 개씩 새로운 데이터를 추가하시오  
* 각 Series 의 index 를 다르게 부여하시오 
* 참고 : obj.reindex ([3, 1, 0, 2]) # index 의 순서바꾸기  
* 각 Series 에서 1 개씩 데이터를 삭제하시오 참고 :  
* 참고 : obj.drop (‘row1’) # index ‘ 에 해당되는 데이터 삭제

In [40]:
data = [10,50,40,30]

obj = pd.Series(data,index=["a","b","c","d"])
print("초기 값\n",obj,end="\n\n")

#Series 데이터 삽입
obj['e']=100 # Series에다가 e라는 key값을가지는 value 100을 추가한다
print("데이터 삽입\n",obj,end='\n\n')

#Series 데이터 삭제 
del obj['d'] # d라는key값과 그에상응하는 value를 지운다
obj=obj.drop('a') # drop이라는 함수는 자가수정기능이없다 자기파괴를하지않는다
obj.drop('b',inplace=True) # 자가수정기능 on 자기파괴를한다

print("데이터 삭제\n",obj,end='\n\n')


# Series 순서바꾸기
obj=obj.reindex(['e','c']) # reindex 자가수정기능이없고 inplace기능이 존재하지않는다
print(obj)

초기 값
 a    10
b    50
c    40
d    30
dtype: int64

데이터 삽입
 a     10
b     50
c     40
d     30
e    100
dtype: int64

데이터 삭제
 c     40
e    100
dtype: int64

e    100
c     40
dtype: int64

In [47]:
data = {"apple":1000,"melon":3000,"banana":2000}
s2 = pd.Series(data) # Dict 로 Series 객체 만들기
print(s2,end="\n\n")
s2["sweatberry"]=10000
s2=s2.drop("apple")

print(s2) # apple 삭제 sweatberry추가

apple     1000
melon     3000
banana    2000
dtype: int64

melon          3000
banana         2000
sweatberry    10000
dtype: int64

# Chapter11. Pandas(2)

In [65]:
from IPython.display import display

data = {"Apples":[3,2,0,1],"Orange":[0,3,7,2]} #Apples 라는Colume 그 안속 데이터들이 3 2 1 0 
data = pd.DataFrame(data) # dataFrame 생성하기
test_data = data
display(data) 

#0,1,2,3 => index
# Apples,Orange => Columes 
# index,Columes 으로 이루어진 DataFrame

   Apples  Orange
0       3       0
1       2       3
2       0       7
3       1       2

In [68]:
row_data ={'col0':[1,2,3,4],'col1':[10,20,30,40],'col2':[100,200,300,400]}

data =pd.DataFrame(row_data)
display(data)

test = test_data + data # ...?

display(test)

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

   Apples  Orange  col0  col1  col2
0     NaN     NaN   NaN   NaN   NaN
1     NaN     NaN   NaN   NaN   NaN
2     NaN     NaN   NaN   NaN   NaN
3     NaN     NaN   NaN   NaN   NaN

### 시계열 데이터 생성

In [81]:
dndx1 = pd.date_range(start='1/1/2020',end='1/20/2020',periods=5) # 첫쨰날과 끝날을 포함하는 5개를나누어 표현한다

dndx1

DatetimeIndex(['2020-01-01 00:00:00', '2020-01-05 18:00:00',
               '2020-01-10 12:00:00', '2020-01-15 06:00:00',
               '2020-01-20 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [94]:
import numpy
datas = pd.date_range('20180521',periods=6)

df = pd.DataFrame(np.random.randn(6,4),index=datas,columns=list('ABCD')) # index와 columes를 지정한다
df

                   A         B         C         D
2018-05-21 -1.089640 -0.330396  2.067622 -0.204037
2018-05-22  0.331360  1.235064  0.071224 -0.188443
2018-05-23  1.204057 -1.745482  1.167918  0.462167
2018-05-24  0.952231  0.761585  0.350549 -0.639127
2018-05-25  0.787866  0.157442 -0.459739 -0.363771
2018-05-26 -0.200268 -0.819148 -0.068878  0.885649

### 본격적인 dataFrame 강의

* 인덱싱 슬라이싱이 제일중요하다

In [112]:
data = {'Name':['lee','kim','jun','chou',],'Year':[2013,2014,2015,2016],'Points':[1.5,1.8,2.3,2.8]}

df = pd.DataFrame(data,index=['one','two','three','four'],columns=['Name','Year','Points',"Nan"]) # Columes 의경우 
#out of range여도 NAN을 Columes를 추가하며 값은 NAN을 할당한다
display(df)

       Name  Year  Points  Nan
one     lee  2013     1.5  NaN
two     kim  2014     1.8  NaN
three   jun  2015     2.3  NaN
four   chou  2016     2.8  NaN

In [121]:
df['Name']

one       lee
two       kim
three     jun
four     chou
Name: Name, dtype: object

In [117]:
display(df[['Name','Year']]) # 두개이상의 columes을 줄시 이중리스트로 주어야한다!!!!!!!!!

       Name  Year
one     lee  2013
two     kim  2014
three   jun  2015
four   chou  2016

In [136]:
# 행슬라이싱 2가지 방안
display(df.iloc[1:3]) # 1행 2행의 데이터값들을 출력한다
display(df.loc['one':'two']) # one two 라는 이름을가지는 행의 데이터들을 출력한다
display(df.iloc[1:3,2:4]) # 2:4 는 1행 2행 2열 3열 끝 숫자 포함x

      Name  Year  Points  Nan
two    kim  2014     1.8  NaN
three  jun  2015     2.3  NaN

    Name  Year  Points  Nan
one  lee  2013     1.5  NaN
two  kim  2014     1.8  NaN

       Points  Nan
two       1.8  NaN
three     2.3  NaN

In [147]:
datas = pd.date_range('20180521',periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=datas , columns = list('ABCD'))
display(df)

                   A         B         C         D
2018-05-21  1.015118  1.014329  0.174922  0.925094
2018-05-22  0.010866 -1.427017 -0.443245  0.242015
2018-05-23  0.302503 -0.924815 -0.309561  1.445945
2018-05-24  0.888157  0.188052  0.544727 -0.483284
2018-05-25  0.053433  0.065538 -1.024100 -1.947929
2018-05-26  0.440401 -1.312992  1.504509 -1.924384

## Boolean Indexing

In [152]:
display(df >0 )

display(df[df>0])

display(df[df.A > 0.3])

               A      B      C      D
2018-05-21  True   True   True   True
2018-05-22  True  False  False   True
2018-05-23  True  False  False   True
2018-05-24  True   True   True  False
2018-05-25  True   True  False  False
2018-05-26  True  False   True  False

                   A         B         C         D
2018-05-21  1.015118  1.014329  0.174922  0.925094
2018-05-22  0.010866       NaN       NaN  0.242015
2018-05-23  0.302503       NaN       NaN  1.445945
2018-05-24  0.888157  0.188052  0.544727       NaN
2018-05-25  0.053433  0.065538       NaN       NaN
2018-05-26  0.440401       NaN  1.504509       NaN

                   A         B         C         D
2018-05-21  1.015118  1.014329  0.174922  0.925094
2018-05-23  0.302503 -0.924815 -0.309561  1.445945
2018-05-24  0.888157  0.188052  0.544727 -0.483284
2018-05-26  0.440401 -1.312992  1.504509 -1.924384